openFOAM/singleFin/gridStudy/baseFin/0.orig/air/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 295;

boundaryField
{
    ".*"
    {
        type            symmetry;
    }
    front
    {
	    type          compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            value           uniform 295;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 295;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 295;
        value           uniform 295;
    }
}


// ************************************************************************* //
