openFOAM/singleFin/gridStudy/baseFin/0.orig/air/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    ".*"
    {
        type            symmetry;
    }

    front
    {
        type            calculated;
        value           uniform 101325;
    }
    ceiling
    {
        type            calculated;
        value           uniform 101325;
    }
    inlet
    {
        type            calculated;
        value           uniform 101325;
    }
    outlet
    {
        type            calculated;
        value           uniform 101325;
    }
    fixedWalls
    {
        type            empty;
    }

}


// ************************************************************************* //
