openFOAM/singleFin/gridStudy/baseFin/Allrun.pre
#!/bin/sh
#cd ${0%/*} || exit 1    # Run from this directory


# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

for i in air fin
do
	cp system/$i/blockMeshDict system
	blockMesh
	rm -r system/blockMeshDict
	mv constant/polyMesh constant/$i
done

cp -r 0.orig 0
