openFOAM/singleFin/gridStudy/baseFin/system/air/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters .001;

vertices
(
    (0 0 0.164)
    (54 0 0.164)
    (54 25 0.164)
    (0 25 0.164)
    (0 0 5)
    (54 0 5)
    (54 25 5)
    (0 25 5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 15 10) simpleGrading (1 1 3)
);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    left
    {
        type symmetry;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
        type symmetry;
        faces
        (
            (2 6 5 1)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    front
    {
        type mappedWall;
        faces
        (
            (0 3 2 1)
        );
	sampleMode      nearestPatchFace;
        sampleRegion    fin;
        samplePatch     back;
    }

    back
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
