openFOAM/singleFin/gridStudy/baseFin/system/air/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default     Euler;
}

gradSchemes
{
    default     Gauss linear;
}


divSchemes
{
    default         none;
    div(phi,U)      Gauss upwind;
    div(phi,h)      Gauss upwind;
    div(phi,e)      Gauss upwind;
    div(phi,k)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(phi,R)      Gauss upwind;
    div(phi,K)      Gauss linear;
    div(phi,Ekp)    Gauss linear;
    div(R)          Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

//divSchemes
//{
//    default         none;
//    div(phi,U)      bounded Gauss limitedLinear 0.2;
//    div(phi,K)      bounded Gauss limitedLinear 0.2;
//    div(phi,h)      bounded Gauss limitedLinear 0.2;
//    div(phi,k)      bounded Gauss limitedLinear 0.2;
//    div(phi,epsilon) bounded Gauss limitedLinear 0.2;
//    div(phi,omega) bounded Gauss limitedLinear 0.2;
//    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
//}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
