openFOAM/singleFin/gridStudy/baseFin/system/air/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;

        smoother         DICGaussSeidel;

    }

    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }

    "(U|h|k|epsilon|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.01;
    }
    "(U|h|e|k|epsilon|R)Final"
    {
        $U;
        relTol          0;
    }


    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }
}

SIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p_rgh           1e-3;
        U               1e-4;
        h               1e-4;

        // possibly check turbulence fields
        "(k|epsilon|omega)" 5e-3;
    }
}

//Start here
PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 10;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}


//End here
relaxationFactors
{
    rho             1.0;
    p_rgh           0.7;
    U               0.3;
    h               0.7;
    "(k|epsilon|omega)" 0.3;
}


// ************************************************************************* //
